Ran Plan for project: `github` dir: `apps/github` workspace: `github`

<details><summary>Show Output</summary>

```diff
github_repository.repo["k8s-apps"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # github_actions_secret.dockerhub_token["meal-notifier"] will be created
+ resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_token["twitch-bot"] will be created
+ resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username["meal-notifier"] will be created
+ resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username["twitch-bot"] will be created
+ resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_chat["meal-notifier"] will be created
+ resource "github_actions_secret" "telegram_chat" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "TELEGRAM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_chat["twitch-bot"] will be created
+ resource "github_actions_secret" "telegram_chat" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "TELEGRAM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_to["meal-notifier"] will be created
+ resource "github_actions_secret" "telegram_to" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "TELEGRAM_TO"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_to["twitch-bot"] will be created
+ resource "github_actions_secret" "telegram_to" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "TELEGRAM_TO"
      + updated_at      = (known after apply)
    }

  # github_repository.repo["api-go-otel-fuego"] will be destroyed
- resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"a970ce6ed0a631684fd0dd980c8eac41651c9ef1ae670f9d4cb194f0f6cd3750\"" -> null
      - full_name                   = "mvaldes14/api-go-otel" -> null
      - git_clone_url               = "git://github.com/mvaldes14/api-go-otel.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/api-go-otel" -> null
      - http_clone_url              = "https://github.com/mvaldes14/api-go-otel.git" -> null
      - id                          = "api-go-otel-fuego" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - name                        = "api-go-otel-fuego" -> null
      - node_id                     = "R_kgDOLTH5sg" -> null
      - primary_language            = "Go" -> null
      - private                     = false -> null
      - repo_id                     = 758249906 -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/api-go-otel.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/api-go-otel" -> null
      - topics                      = [
          - "homelab",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null
    }

  # github_repository.repo["k8s-apps"] will be updated in-place
~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "k8s-apps"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "k8s-apps"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["obs-go-cli"] will be destroyed
- resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"f67f107e69dd70f20b76748aa8126b12f5aa254ac282c2cb13a685977f22db8d\"" -> null
      - full_name                   = "mvaldes14/obs-go-cli" -> null
      - git_clone_url               = "git://github.com/mvaldes14/obs-go-cli.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/obs-go-cli" -> null
      - http_clone_url              = "https://github.com/mvaldes14/obs-go-cli.git" -> null
      - id                          = "obs-go-cli" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - name                        = "obs-go-cli" -> null
      - node_id                     = "R_kgDOLFXWuA" -> null
      - primary_language            = "Go" -> null
      - private                     = false -> null
      - repo_id                     = 743823032 -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/obs-go-cli.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/obs-go-cli" -> null
      - topics                      = [
          - "homelab",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null
    }

Plan: 8 to add, 1 to change, 2 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p github`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgithub%252Fgithub)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p github`
</details>
Plan: 8 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`